{
  "format": "graph-model",
  "generatedBy": "2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "input_layer": {
        "name": "input_layer:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "3"}]}
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {"dim": [{"size": "-1"}, {"size": "29"}]}
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_0_Add",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "1"},
                  {"size": "128"},
                  {"size": "256"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_6_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "3"},
                  {"size": "64"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "64"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "64"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "64"},
                  {"size": "128"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "128"},
                  {"size": "128"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "128"},
                  {"size": "128"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "128"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "128"},
                  {"size": "256"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "256"},
                  {"size": "256"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_5_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "256"},
                  {"size": "256"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {"size": "1"},
                  {"size": "3"},
                  {"size": "256"},
                  {"size": "256"}
                ]
              }
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/global_average_pooling1d_1/Mean/reduction_indices",
        "op": "Const",
        "attr": {
          "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}},
          "dtype": {"type": "DT_INT32"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "256"}, {"size": "512"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/mul",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "512"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/sub",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "512"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "512"}, {"size": "29"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {"dim": [{"size": "29"}]}
            }
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "input_layer",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "3"}]}
          },
          "dtype": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "input_layer",
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "use_cudnn_on_gpu": {"b": true},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": ["StatefulPartitionedCall/functional_1/conv1d_1/convolution"],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "use_cudnn_on_gpu": {"b": true},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_1_2/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_1_2/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "use_cudnn_on_gpu": {"b": true},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_2_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_2_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add",
        "op": "AddN",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_1_2/Relu",
          "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/mul_1"
        ],
        "attr": {
          "N": {"i": "2"},
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_1/ArithmeticOptimizer/AddOpsRewrite_Add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/sub",
          "StatefulPartitionedCall/functional_1/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_3_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/add_1/ArithmeticOptimizer/AddOpsRewrite_Add"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_3_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_3_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "use_cudnn_on_gpu": {"b": true},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_6_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_6_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_4_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_4_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_5_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_5_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add",
        "op": "AddN",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_6_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_5_1/batchnorm/mul_1"
        ],
        "attr": {
          "N": {"i": "2"},
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_0_Add",
          "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_5_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Add"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_5_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_6_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_6_1/Relu",
          "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims/dim"
        ],
        "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution",
        "op": "Conv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": {"s": "U0FNRQ=="},
          "data_format": {"s": "TkhXQw=="},
          "strides": {"list": {"i": ["1", "1", "1", "1"]}},
          "use_cudnn_on_gpu": {"b": true},
          "T": {"type": "DT_FLOAT"},
          "explicit_paddings": {"list": {}},
          "dilations": {"list": {"i": ["1", "1", "1", "1"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "squeeze_dims": {"list": {"i": ["-3"]}}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/Squeeze",
          "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_2_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add",
        "op": "AddN",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_5_1/Relu",
          "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/mul_1"
        ],
        "attr": {
          "N": {"i": "2"},
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/add_2_1/ArithmeticOptimizer/AddOpsRewrite_Add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/sub",
          "StatefulPartitionedCall/functional_1/add_2_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_Add"
        ],
        "attr": {
          "T": {"type": "DT_FLOAT"},
          "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_7_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/add_2_1/ArithmeticOptimizer/AddOpsRewrite_Add"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/global_average_pooling1d_1/Mean",
        "op": "Mean",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_7_1/Relu",
          "StatefulPartitionedCall/functional_1/global_average_pooling1d_1/Mean/reduction_indices"
        ],
        "attr": {
          "Tidx": {"type": "DT_INT32"},
          "T": {"type": "DT_FLOAT"},
          "keep_dims": {"b": false}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1/MatMul",
        "op": "MatMul",
        "input": [
          "StatefulPartitionedCall/functional_1/global_average_pooling1d_1/Mean",
          "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": {"b": false},
          "grad_a": {"b": false},
          "T": {"type": "DT_FLOAT"},
          "grad_b": {"b": false},
          "transpose_b": {"b": false}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/functional_1/dense_1/MatMul",
          "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/mul"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/mul_1",
          "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/sub"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/activation_8_1/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/add_1"
        ],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/functional_1/activation_8_1/Relu",
          "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
          "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": {"b": false},
          "transpose_b": {"b": false},
          "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}},
          "leakyrelu_alpha": {"f": 0.2},
          "num_args": {"i": "1"},
          "epsilon": {"f": 0.0},
          "T": {"type": "DT_FLOAT"}
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd"],
        "attr": {"T": {"type": "DT_FLOAT"}}
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/functional_1/dense_1_2/Softmax"],
        "attr": {"T": {"type": "DT_FLOAT"}}
      }
    ],
    "library": {},
    "versions": {"producer": 2129}
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/sub",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/add_1_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_0_Add",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_6_1/convolution/ExpandDims_1",
          "shape": [1, 1, 128, 256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_6_1/batchnorm/mul",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/sub",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1",
          "shape": [1, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/mul",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_1/batchnorm/sub",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1",
          "shape": [1, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/mul",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_1_2/batchnorm/sub",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_2_1/convolution/ExpandDims_1",
          "shape": [1, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/mul",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_2_1/batchnorm/sub",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_3_1/convolution/ExpandDims_1",
          "shape": [1, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_3_1/batchnorm/mul",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_4_1/convolution/ExpandDims_1",
          "shape": [1, 3, 128, 256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/mul",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_4_1/batchnorm/sub",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_5_1/convolution/ExpandDims_1",
          "shape": [1, 3, 256, 256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_5_1/batchnorm/mul",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_7_1/convolution/ExpandDims_1",
          "shape": [1, 3, 256, 256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/mul",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_7_1/batchnorm/sub",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_8_1/convolution/ExpandDims_1",
          "shape": [1, 3, 256, 256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_8_1/batchnorm/mul",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/global_average_pooling1d_1/Mean/reduction_indices",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
          "shape": [256, 512],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/mul",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/batch_normalization_9_1/batchnorm/sub",
